//  --------------------------------------------------241
 // -----------------------------------------------1
пусть elem1 = document.Селектор запросов ('#elem1');
console.log(элемент1);
пусть elem2 = document .Выбор запросов ('#elem2');
console.log(elem2);
пусть elem3 = document .Выбор запросов ('#elem3');
console.log(elem3);


// ----------------------------------------2
// пусть блок = документ.Селектор запросов ('#блок p');
// console.log(блок);



//  --------------------------------------------3
// пусть блок = документ.Выбор запросов ('.блок p');
// console.log(блок);



// --------------------------------------------------4
// пусть www = document.Выбор запросов ('.www');
// console.log(www); // p




// -----------------------------------------------------242


// --------------------------------------------------------1
// пусть button1 = документ.Селектор запросов ('#button1');
// пусть button2 = документ.Выбор запросов ('#button2');
// пусть button3 = документ.Выбор запросов ('#button3');
// button1.addEventListener('щелчок', функция() {
// console.log('1');
// });
// button2.addEventListener('щелчок', функция() {
// console.log('2');
// });
// button3.addEventListener('щелчок', функция() {
// console.log('3');
// });


// ---------------------------------------------------------243

// -------------------------------------------------------------1
// пусть button1 = документ.Селектор запросов ('#button1');
// button1.addEventListener('щелчок', функция() {
// console.log('func1');
//     })
// пусть button2 = документ.Выбор запросов ('#button2');
// button1.addEventListener('щелчок', функция() {
// console.log('func2');
//     })


// -----------------------------------------------------------------244
// пусть elem1 = document.Селектор запросов ('#elem1');
// пусть elem2 = document .Выбор запросов ('#elem2');
// пусть elem3 = document .Выбор запросов ('#elem3');
// пусть elem4 = document .Выбор запросов ('#elem4');
// пусть elem5 = document .Селектор запросов ('#elem5');
// elem1.addEventListener("щелчок", функция);
// elem2.addEventListener("щелчок", функция);
// elem3.addEventListener("щелчок", функция);
// elem4.addEventListener("щелчок", функция);
// elem5.addEventListener("щелчок", функция);
// функция func() {
// console.log('сообщение');
// }


//----------------------------------------------------------------------245
// функция func1() {
// console.log('1');
// }

// функция func2() {
// console.log('2');
// }

// функция func3() {
// console.log('3');
// }
// пусть elem = document.Выбор запросов ('#elem');
// elem.addEventListener('щелчок', func1);
// elem.addEventListener("щелчок", func2);
// elem.addEventListener("щелчок", func3);

// -----------------------------------------------------------------------------246

// ------------------------------------------------------------------------------1
// elem1.addEventListener('dblclick', функция() {
// console.log('Салам');
// });

// ---------------------------------------------------------------------------------2
// elem1.addEventListener(наведение курсора мыши, функция() {
// console.log('Салам');
// });

// -----------------------------------------------------------------------------------3
// elem1.addEventListener('mouseout', функция() {
// console.log('Поставьте 5');
// });

// -----------------------------------------------------------------------------------4
// elem1.addEventListener(наведение курсора мыши, функция() {
// console.log('Привет');
// });
// elem1.addEventListener('mouseout', функция() {
// console.log('Пока');
// });